tests/integration/asc_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://api.gladmindsplatform.co/api/v1/bajaj/feed/">
  <SOAP-ENV:Body>
    <ns1:postASC>
      <ns1:ObjectList>
        <ns1:ASCData>
          <ns1:ASCModel>
            <ns1:ASC_EMAIL>asc@gmail.com</ns1:ASC_EMAIL>
            <ns1:ASC_ADDRESS>HSR</ns1:ASC_ADDRESS>
            <ns1:KUNNAR>GMDEALER001</ns1:KUNNAR>
            <ns1:ASC_ID>ASC001</ns1:ASC_ID>
            <ns1:ASC_MOBILE>34256</ns1:ASC_MOBILE>
            <ns1:ASC_NAME>xyz</ns1:ASC_NAME>
          </ns1:ASCModel>
        </ns1:ASCData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>admin</ns1:UserName>
        <ns1:Password>admin</ns1:Password>
      </ns1:Credential>
    </ns1:postASC>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>